Revit 2027 API
TableSectionData.GetColumnWidth Method
 Returns a column's width in feet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetColumnWidth(
	int nCol
)
Public Function GetColumnWidth (
	nCol As Integer
) As Double
public:
double GetColumnWidth(
	int nCol
)
member GetColumnWidth :
        nCol : int -> float
Parameters
nCol Int32
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace